INSERT INTO t_subject_type
VALUES
	(999, '未知'),
	(1, '一、资产类'),
	(2, '二、负债类'),
	(
		3,
		'三、所有者权益类'
	),
	(4, '四、成本类'),
	(5, '五、损益类');
INSERT INTO t_subject (
	subject_id,
	subject_type,
	subject_name
)
VALUES
	('1001', 1, '库存现金'),
	('1002', 1, '银行存款'),
	(
		'1012',
		1,
		'其他货币资金'
	),
	('1101', 1, '短期投资'),
	('1121', 1, '应收票据'),
	('1122', 1, '应收账款'),
	('1123', 1, '预付账款'),
	('1131', 1, '应收股利'),
	('1132', 1, '应收利息'),
	('1221', 1, '其他应收款'),
	('1401', 1, '材料采购'),
	('1402', 1, '在途物资'),
	('1403', 1, '原材料'),
	(
		'1404',
		1,
		'材料成本差异'
	),
	('1405', 1, '库存商品'),
	(
		'1407',
		1,
		'商品进销差价'
	),
	(
		'1408',
		1,
		'委托加工物资'
	),
	('1411', 1, '周转材料'),
	(
		'1421',
		1,
		'消耗性生物资产'
	),
	(
		'1501',
		1,
		'长期债券投资'
	),
	(
		'1511',
		1,
		'长期股权投资'
	),
	('1601', 1, '固定资产'),
	('1602', 1, '累计折旧'),
	('1604', 1, '在建工程'),
	('1605', 1, '工程物资'),
	(
		'1606',
		1,
		'固定资产清理'
	),
	(
		'1621',
		1,
		'生产性生物资产'
	),
	(
		'1622',
		1,
		'生产性生物资产累计折旧'
	),
	('1701', 1, '无形资产'),
	('1702', 1, '累计摊销'),
	(
		'1801',
		1,
		'长期待摊费用'
	),
	(
		'1901',
		1,
		'待处理财产损溢'
	),
	('2001', 2, '短期借款'),
	('2201', 2, '应付票据'),
	('2202', 2, '应付账款'),
	('2203', 2, '预收账款'),
	(
		'2211',
		2,
		'应付职工薪酬'
	),
	('2221', 2, '应交税费'),
	('2231', 2, '应付利息'),
	('2232', 2, '应付利润'),
	('2241', 2, '其他应付款'),
	('2401', 2, '递延收益'),
	('2501', 2, '长期借款'),
	('2701', 2, '长期应付款'),
	('3001', 3, '实收资本'),
	('3002', 3, '资本公积'),
	('3101', 3, '盈余公积'),
	('3103', 3, '本年利润'),
	('3104', 3, '利润分配'),
	('4001', 4, '生产成本'),
	('4101', 4, '制造费用'),
	('4301', 4, '研发支出'),
	('4401', 4, '工程施工'),
	('4403', 4, '机械作业'),
	(
		'5001',
		5,
		'主营业务收入'
	),
	(
		'5051',
		5,
		'其他业务收入'
	),
	('5111', 5, '投资收益'),
	('5301', 5, '营业外收入'),
	(
		'5401',
		5,
		'主营业务成本'
	),
	(
		'5402',
		5,
		'其他业务成本'
	),
	(
		'5403',
		5,
		'营业税金及附加'
	),
	('5601', 5, '销售费用'),
	('5602', 5, '管理费用'),
	('5603', 5, '财务费用'),
	('5711', 5, '营业外支出'),
	('5801', 5, '所得税费用');